; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 325471 2 2 2 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star0 - direction
	Star7 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(have_image Planet8 infrared0)
	(have_image Planet9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Star13 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 6
4. (turn_to satellite1 star12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star12)
   goals met: 0 of 6
5. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 6
6. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 0 of 6
7. (turn_to satellite0 star13 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star13)
   goals met: 0 of 6
8. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
9. (take_image satellite0 star13 instrument1 infrared0)
   added: (have_image star13 infrared0)
   goals met: 1 of 6
10. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 1 of 6
11. (turn_to satellite0 star12 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star12)
   goals met: 1 of 6
12. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 1 of 6
13. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 2 of 6
14. (turn_to satellite1 planet8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet8)
   goals met: 2 of 6
15. (turn_to satellite0 star10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
16. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 2 of 6
17. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 3 of 6
18. (turn_to satellite1 planet11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet11)
   goals met: 3 of 6
19. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
20. (turn_to satellite1 planet9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet9)
   goals met: 3 of 6
21. (take_image satellite0 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 6
22. (turn_to satellite1 groundstation4 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation4)
   goals met: 4 of 6
23. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   goals met: 4 of 6
24. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 4 of 6
25. (take_image satellite0 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 5 of 6
26. (turn_to satellite1 planet9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet9)
   goals met: 5 of 6
27. (take_image satellite1 planet9 instrument3 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 6 of 6
